; domain
(define (domain grid)
  (:requirements :strips)
  (:predicates
    ; types
    (place ?x)
    (key ?k)
    (shape ?s)
    ; static predicates
    (conn ?x ?y)
    (key-shape ?k ?s)
    (lock-shape ?x ?s)
    ; fluents
    (at ?k ?x)
    (at-robot ?x)
    (holding ?k)
    (arm-empty)
    (locked ?x)
    (open ?x)
  )

  ; move from ?curpos to adjacent ?nextpos that is open
  (:action move
    :parameters (?curpos ?nextpos)
    :precondition (and (place ?curpos)
                       (place ?nextpos)
                       (conn ?curpos ?nextpos)
                       (at-robot ?curpos)
                       (open ?nextpos))
    :effect (and (at-robot ?nextpos)
                 (not (at-robot ?curpos))))

  ; pick ?key that is at ?curpos when not holding another key
  (:action pickup
    :parameters (?curpos ?key)
    :precondition (and (place ?curpos)
                       (key ?key)
                       (at ?key ?curpos)
                       (at-robot ?curpos)
                       (arm-empty))
    :effect (and (holding ?key)
                 (not (at ?key ?curpos))
                 (not (arm-empty))))

  ; pick ?newkey at ?curpos while holding/dropping ?oldkey (equiv. to putdown followed by pickup)
  (:action pickup-and-loose
    :parameters (?curpos ?newkey ?oldkey)
    :precondition (and (place ?curpos)
                       (key ?newkey)
                       (key ?oldkey)
                       (at ?newkey ?curpos)
                       (at-robot ?curpos)
                       (holding ?oldkey))
    :effect (and (holding ?newkey)
                 (at ?oldkey ?curpos)
                 (not (holding ?oldkey))
                 (not (at ?newkey ?curpos))))

  ; putdown ?key being held at ?curpos
  (:action putdown
    :parameters (?curpos ?key)
    :precondition (and (place ?curpos)
                       (key ?key)
                       (at-robot ?curpos)
                       (holding ?key))
    :effect (and (arm-empty)
                 (at ?key ?curpos)
                 (not (holding ?key))))

  ; unlock ?lockpos adjacent to ?curpos using ?key begin held of matching ?shape
  (:action unlock
    :parameters (?curpos ?lockpos ?key ?shape)
    :precondition (and (place ?curpos)
                       (place ?lockpos)
                       (key ?key)
                       (shape ?shape)
                       (conn ?curpos ?lockpos)
                       (key-shape ?key ?shape)
                       (lock-shape ?lockpos ?shape)
                       (at-robot ?curpos)
                       (locked ?lockpos)
                       (holding ?key))
    :effect (and (open ?lockpos)
                 (not (locked ?lockpos))))
)

; problem
(define (problem grid_9room3_fpl_s3_seed11604_n0)
  (:domain grid)
  (:objects
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 p21 p22 p23 p24 p25 p26 p27 p28 p29 p30 p31 p32 p33 p34 p35 p36 p37 p38 p39 p40 p41 p42 p43 p44 p45 p46 p47 p48 p49 p50 p51 p52 p53 p54 p55 p56 p57 p58 p59 p60 p61 p62 p63 p64 p65 p66 p67 p68 p69 p70 p71 p72 p73 p74 p75 p76 p77 p78 p79 p80 p81 p82 p83 p84 p85 p86 p87 p88 p89
    shape0 shape1 shape2
    key0 key1 key2
  )
  (:init
    ; Object types
    (place p0) (place p1) (place p2) (place p3) (place p4) (place p5) (place p6) (place p7) (place p8) (place p9) (place p10) (place p11) (place p12) (place p13) (place p14) (place p15) (place p16) (place p17) (place p18) (place p19) (place p20) (place p21) (place p22) (place p23) (place p24) (place p25) (place p26) (place p27) (place p28) (place p29) (place p30) (place p31) (place p32) (place p33) (place p34) (place p35) (place p36) (place p37) (place p38) (place p39) (place p40) (place p41) (place p42) (place p43) (place p44) (place p45) (place p46) (place p47) (place p48) (place p49) (place p50) (place p51) (place p52) (place p53) (place p54) (place p55) (place p56) (place p57) (place p58) (place p59) (place p60) (place p61) (place p62) (place p63) (place p64) (place p65) (place p66) (place p67) (place p68) (place p69) (place p70) (place p71) (place p72) (place p73) (place p74) (place p75) (place p76) (place p77) (place p78) (place p79) (place p80) (place p81) (place p82) (place p83) (place p84) (place p85) (place p86) (place p87) (place p88) (place p89)
    (shape shape0) (shape shape1) (shape shape2)
    (key key0) (key key1) (key key2)
    ; Open/locked cells
    (open p0) (open p1) (open p2) (open p4) (open p5) (open p6) (open p7) (open p8) (open p9) (open p10) (open p11) (open p12) (open p13) (open p14) (open p15) (open p17) (open p18) (open p19) (open p20) (open p21) (open p22) (open p23) (open p24) (open p25) (open p26) (open p27) (open p28) (open p31) (open p32) (open p33) (open p35) (open p36) (open p37) (open p38) (open p39) (open p40) (open p41) (open p42) (open p43) (open p44) (open p45) (open p46) (open p48) (open p49) (open p50) (open p51) (open p52) (open p53) (open p54) (open p55) (open p56) (open p57) (open p58) (open p59) (open p61) (open p62) (open p63) (open p64) (open p65) (open p66) (open p68) (open p69) (open p70) (open p71) (open p72) (open p73) (open p74) (open p75) (open p76) (open p77) (open p78) (open p79) (open p80) (open p81) (open p82) (open p84) (open p85) (open p86) (open p87) (open p88) (open p89)
    (locked p3) (locked p16) (locked p29) (locked p30) (locked p34) (locked p47) (locked p60) (locked p67) (locked p83)
    ; Connected cells
    (conn p0 p1)
    (conn p0 p10)
    (conn p1 p0)
    (conn p1 p2)
    (conn p1 p11)
    (conn p2 p1)
    (conn p2 p3)
    (conn p2 p12)
    (conn p3 p2)
    (conn p3 p4)
    (conn p4 p3)
    (conn p4 p5)
    (conn p4 p13)
    (conn p5 p4)
    (conn p5 p6)
    (conn p5 p14)
    (conn p6 p5)
    (conn p6 p15)
    (conn p7 p8)
    (conn p7 p17)
    (conn p8 p7)
    (conn p8 p9)
    (conn p8 p18)
    (conn p9 p8)
    (conn p9 p19)
    (conn p10 p0)
    (conn p10 p11)
    (conn p10 p20)
    (conn p11 p10)
    (conn p11 p1)
    (conn p11 p12)
    (conn p11 p21)
    (conn p12 p11)
    (conn p12 p2)
    (conn p12 p22)
    (conn p13 p4)
    (conn p13 p14)
    (conn p13 p23)
    (conn p14 p13)
    (conn p14 p5)
    (conn p14 p15)
    (conn p14 p24)
    (conn p15 p14)
    (conn p15 p6)
    (conn p15 p16)
    (conn p15 p25)
    (conn p16 p15)
    (conn p16 p17)
    (conn p17 p16)
    (conn p17 p7)
    (conn p17 p18)
    (conn p17 p26)
    (conn p18 p17)
    (conn p18 p8)
    (conn p18 p19)
    (conn p18 p27)
    (conn p19 p18)
    (conn p19 p9)
    (conn p19 p28)
    (conn p20 p10)
    (conn p20 p21)
    (conn p21 p20)
    (conn p21 p11)
    (conn p21 p22)
    (conn p21 p29)
    (conn p22 p21)
    (conn p22 p12)
    (conn p23 p13)
    (conn p23 p24)
    (conn p24 p23)
    (conn p24 p14)
    (conn p24 p25)
    (conn p25 p24)
    (conn p25 p15)
    (conn p26 p17)
    (conn p26 p27)
    (conn p26 p30)
    (conn p27 p26)
    (conn p27 p18)
    (conn p27 p28)
    (conn p28 p27)
    (conn p28 p19)
    (conn p29 p21)
    (conn p29 p32)
    (conn p30 p26)
    (conn p30 p38)
    (conn p31 p32)
    (conn p31 p41)
    (conn p32 p31)
    (conn p32 p29)
    (conn p32 p33)
    (conn p32 p42)
    (conn p33 p32)
    (conn p33 p34)
    (conn p33 p43)
    (conn p34 p33)
    (conn p34 p35)
    (conn p35 p34)
    (conn p35 p36)
    (conn p35 p44)
    (conn p36 p35)
    (conn p36 p37)
    (conn p36 p45)
    (conn p37 p36)
    (conn p37 p46)
    (conn p38 p30)
    (conn p38 p39)
    (conn p38 p48)
    (conn p39 p38)
    (conn p39 p40)
    (conn p39 p49)
    (conn p40 p39)
    (conn p40 p50)
    (conn p41 p31)
    (conn p41 p42)
    (conn p41 p51)
    (conn p42 p41)
    (conn p42 p32)
    (conn p42 p43)
    (conn p42 p52)
    (conn p43 p42)
    (conn p43 p33)
    (conn p43 p53)
    (conn p44 p35)
    (conn p44 p45)
    (conn p44 p54)
    (conn p45 p44)
    (conn p45 p36)
    (conn p45 p46)
    (conn p45 p55)
    (conn p46 p45)
    (conn p46 p37)
    (conn p46 p47)
    (conn p46 p56)
    (conn p47 p46)
    (conn p47 p48)
    (conn p48 p47)
    (conn p48 p38)
    (conn p48 p49)
    (conn p48 p57)
    (conn p49 p48)
    (conn p49 p39)
    (conn p49 p50)
    (conn p49 p58)
    (conn p50 p49)
    (conn p50 p40)
    (conn p50 p59)
    (conn p51 p41)
    (conn p51 p52)
    (conn p52 p51)
    (conn p52 p42)
    (conn p52 p53)
    (conn p53 p52)
    (conn p53 p43)
    (conn p53 p60)
    (conn p54 p44)
    (conn p54 p55)
    (conn p55 p54)
    (conn p55 p45)
    (conn p55 p56)
    (conn p56 p55)
    (conn p56 p46)
    (conn p57 p48)
    (conn p57 p58)
    (conn p58 p57)
    (conn p58 p49)
    (conn p58 p59)
    (conn p59 p58)
    (conn p59 p50)
    (conn p60 p53)
    (conn p60 p63)
    (conn p61 p62)
    (conn p61 p71)
    (conn p62 p61)
    (conn p62 p63)
    (conn p62 p72)
    (conn p63 p62)
    (conn p63 p60)
    (conn p63 p73)
    (conn p64 p65)
    (conn p64 p74)
    (conn p65 p64)
    (conn p65 p66)
    (conn p65 p75)
    (conn p66 p65)
    (conn p66 p67)
    (conn p66 p76)
    (conn p67 p66)
    (conn p67 p68)
    (conn p68 p67)
    (conn p68 p69)
    (conn p68 p77)
    (conn p69 p68)
    (conn p69 p70)
    (conn p69 p78)
    (conn p70 p69)
    (conn p70 p79)
    (conn p71 p61)
    (conn p71 p72)
    (conn p71 p80)
    (conn p72 p71)
    (conn p72 p62)
    (conn p72 p73)
    (conn p72 p81)
    (conn p73 p72)
    (conn p73 p63)
    (conn p73 p82)
    (conn p74 p64)
    (conn p74 p75)
    (conn p74 p84)
    (conn p75 p74)
    (conn p75 p65)
    (conn p75 p76)
    (conn p75 p85)
    (conn p76 p75)
    (conn p76 p66)
    (conn p76 p86)
    (conn p77 p68)
    (conn p77 p78)
    (conn p77 p87)
    (conn p78 p77)
    (conn p78 p69)
    (conn p78 p79)
    (conn p78 p88)
    (conn p79 p78)
    (conn p79 p70)
    (conn p79 p89)
    (conn p80 p71)
    (conn p80 p81)
    (conn p81 p80)
    (conn p81 p72)
    (conn p81 p82)
    (conn p82 p81)
    (conn p82 p73)
    (conn p82 p83)
    (conn p83 p82)
    (conn p83 p84)
    (conn p84 p83)
    (conn p84 p74)
    (conn p84 p85)
    (conn p85 p84)
    (conn p85 p75)
    (conn p85 p86)
    (conn p86 p85)
    (conn p86 p76)
    (conn p87 p77)
    (conn p87 p88)
    (conn p88 p87)
    (conn p88 p78)
    (conn p88 p89)
    (conn p89 p88)
    (conn p89 p79)
    ; Lock and key shapes
    (lock-shape p16 shape2)
    (lock-shape p34 shape1)
    (lock-shape p60 shape0)
    (lock-shape p83 shape1)
    (lock-shape p3 shape1)
    (lock-shape p30 shape2)
    (lock-shape p47 shape1)
    (lock-shape p29 shape0)
    (lock-shape p67 shape2)
    (key-shape key0 shape0)
    (key-shape key1 shape1)
    (key-shape key2 shape2)
    ; Key placement
    (at key0 p81)
    (at key1 p11)
    (at key2 p89)
    ; Robot placement
    (at-robot p72)
    (arm-empty)
  )
  (:goal (at-robot p50))
)

; plan
1. (move p72 p81)
   deleted: (at-robot p72)
   added: (at-robot p81)
   goals met: 0 of 1
2. (pickup p81 key0)
   deleted: (at key0 p81) (arm-empty)
   added: (holding key0)
   goals met: 0 of 1
3. (move p81 p82)
   deleted: (at-robot p81)
   added: (at-robot p82)
   goals met: 0 of 1
4. (move p82 p73)
   deleted: (at-robot p82)
   added: (at-robot p73)
   goals met: 0 of 1
5. (move p73 p63)
   deleted: (at-robot p73)
   added: (at-robot p63)
   goals met: 0 of 1
6. (unlock p63 p60 key0 shape0)
   deleted: (locked p60)
   added: (open p60)
   goals met: 0 of 1
7. (move p63 p60)
   deleted: (at-robot p63)
   added: (at-robot p60)
   goals met: 0 of 1
8. (move p60 p53)
   deleted: (at-robot p60)
   added: (at-robot p53)
   goals met: 0 of 1
9. (move p53 p52)
   deleted: (at-robot p53)
   added: (at-robot p52)
   goals met: 0 of 1
10. (move p52 p42)
   deleted: (at-robot p52)
   added: (at-robot p42)
   goals met: 0 of 1
11. (move p42 p32)
   deleted: (at-robot p42)
   added: (at-robot p32)
   goals met: 0 of 1
12. (unlock p32 p29 key0 shape0)
   deleted: (locked p29)
   added: (open p29)
   goals met: 0 of 1
13. (move p32 p29)
   deleted: (at-robot p32)
   added: (at-robot p29)
   goals met: 0 of 1
14. (move p29 p21)
   deleted: (at-robot p29)
   added: (at-robot p21)
   goals met: 0 of 1
15. (move p21 p11)
   deleted: (at-robot p21)
   added: (at-robot p11)
   goals met: 0 of 1
16. (pickup-and-loose p11 key1 key0)
   deleted: (holding key0) (at key1 p11)
   added: (holding key1) (at key0 p11)
   goals met: 0 of 1
17. (move p11 p21)
   deleted: (at-robot p11)
   added: (at-robot p21)
   goals met: 0 of 1
18. (move p21 p29)
   deleted: (at-robot p21)
   added: (at-robot p29)
   goals met: 0 of 1
19. (move p29 p32)
   deleted: (at-robot p29)
   added: (at-robot p32)
   goals met: 0 of 1
20. (move p32 p33)
   deleted: (at-robot p32)
   added: (at-robot p33)
   goals met: 0 of 1
21. (unlock p33 p34 key1 shape1)
   deleted: (locked p34)
   added: (open p34)
   goals met: 0 of 1
22. (move p33 p34)
   deleted: (at-robot p33)
   added: (at-robot p34)
   goals met: 0 of 1
23. (move p34 p35)
   deleted: (at-robot p34)
   added: (at-robot p35)
   goals met: 0 of 1
24. (move p35 p36)
   deleted: (at-robot p35)
   added: (at-robot p36)
   goals met: 0 of 1
25. (move p36 p45)
   deleted: (at-robot p36)
   added: (at-robot p45)
   goals met: 0 of 1
26. (move p45 p46)
   deleted: (at-robot p45)
   added: (at-robot p46)
   goals met: 0 of 1
27. (unlock p46 p47 key1 shape1)
   deleted: (locked p47)
   added: (open p47)
   goals met: 0 of 1
28. (move p46 p47)
   deleted: (at-robot p46)
   added: (at-robot p47)
   goals met: 0 of 1
29. (move p47 p48)
   deleted: (at-robot p47)
   added: (at-robot p48)
   goals met: 0 of 1
30. (move p48 p49)
   deleted: (at-robot p48)
   added: (at-robot p49)
   goals met: 0 of 1
31. (move p49 p50)
   deleted: (at-robot p49)
   added: (at-robot p50)
   goals met: 1 of 1
